package com.example.quick_recipe_system.model.cuisine;

import java.util.List;

import com.example.quick_recipe_system.model.Recipe;

public class JapaneseCuisine extends AbstractCuisine {

        @Override
        public String getCuisineName() {
                return "日式料理";
        }

        public JapaneseCuisine() {
                // 1.
                this.addRecipe(new Recipe(
                                6, "日式炒烏龍麵", 15,
                                List.of("生烏龍麵", "豬肉片/雞腿肉塊(去皮去骨)", "洋蔥絲", "紅蘿蔔絲", "鮮香菇片", "小白菜", "柴魚片/蔥花"),
                                List.of("醬油", "味琳", "清酒", "柴魚高湯", "烏醋", "黑胡椒"),
                                List.of("起平底鍋放入肉類、蔬菜料，少許油拌炒均勻",
                                                "倒入醬油、味琳、清酒(比例3:2:2)、柴魚高湯煮勻",
                                                "放入烏龍麵，蓋鍋中火悶煮軟爛數分鐘，讓麵條吸附醬汁",
                                                "加入小白菜拌勻",
                                                "煮到湯濃稠即可起鍋"),
                                List.of("麵料理", "主食"), "123"));
                // 2.
                this.addRecipe(new Recipe(7, "日式炸豬排", 25,
                                List.of("豬里肌", "低筋麵粉", "麵包粉"),
                                List.of("鹽巴", "黑胡椒", "日式豬排醬", "蛋液"),
                                List.of("取豬里肌肉去筋膜拍扁",
                                                "撒上鹽巴、黑胡椒，沾裹低筋麵粉、蛋液、麵包粉",
                                                "起150度油鍋，放入豬里肌炸熟",
                                                "豬里肌炸熟後，取出切條",
                                                "淋上日式豬排醬即可"),
                                List.of("炸物", "家常菜"), "123"));
                // 3.
                this.addRecipe(new Recipe(8, "玉子燒",
                                10,
                                List.of("雞蛋"),
                                List.of("味醂", "鹽", "油"),
                                List.of("將雞蛋分別打入碗中，確認無壞蛋後混合",
                                                "加入味醂和鹽，攪拌均勻",
                                                "平底鍋以小火加熱，塗上薄薄一層油",
                                                "將1/3的蛋液倒入鍋中，從後往前捲起",
                                                "將捲好的蛋推至鍋底，再倒入1/3的蛋液，重複捲起。重複步驟，直到蛋液用完",
                                                "將玉子燒稍微壓平，放在砧板上切成六等份",
                                                "放涼後可放入冰箱冷藏",
                                                "也可以在步驟五的時候加入餡料，例如：皮蛋、海苔、起司（餡料不要放到最前方，防止翻動的時候餡料溢出"),
                                List.of("蛋料理", "家常菜"), "123"));
                // 4.
                this.addRecipe(new Recipe(9, "日式咖哩", 180,
                                List.of("馬鈴薯", "紅蘿蔔", "洋蔥", "咖哩塊一盒", "牛肋條", "大蒜"),
                                List.of("鹽巴", "黑胡椒", "無鹽奶油"),
                                List.of("牛肋條擦擦乾後，抓鹽巴、黑胡椒醃製20分鐘",
                                                "馬鈴薯切塊後泡冷水防止黑化，紅蘿蔔切小塊、切蒜末",
                                                "洋蔥一半切條，一半切碎另外放置",
                                                "熱油鍋煎牛肋條，再加一點無鹽奶油，8分鐘後取出放置",
                                                "利用牛油炒香洋蔥條，加一點黑胡椒調味",
                                                "洋蔥條炒至半透明後加入紅蘿蔔拌炒，炒一炒後加入蒜末拌炒",
                                                "再加入馬鈴薯拌炒，再加入牛肉拌炒",
                                                "加入水至醃過材料，滾了之後轉小火燉煮，蓋鍋悶煮1小時，關火靜置1.5小時",
                                                "開火煮15分鐘，試試肉的口感，下咖哩塊，一直攪拌",
                                                "最後再加入洋蔥碎攪一攪"),
                                List.of("家常菜", "濃郁"), "123"));
                // 5.
                this.addRecipe(new Recipe(10, "親子丼", 40,
                                List.of("雞胸肉", "洋蔥", "蛋", "蔥花"),
                                List.of("柴魚醬油", "味醂", "水", "醬油", "糖", "太白粉水"),
                                List.of("洋蔥洗淨切絲，雞胸肉切成適口小塊",
                                                "將雞胸肉、洋蔥、柴魚醬油、味醂、水、醬油、糖全部放入鍋中",
                                                "以中火加熱不斷攪拌，煮約10~15分鐘，至洋蔥和雞胸肉熟透",
                                                "加入太白粉水勾芡拌勻，蛋打散備用",
                                                "將蛋液均勻倒入鍋中，蓋上鍋蓋不時攪拌一下",
                                                "以中小火悶煮約3分鐘，至蛋液半熟，撒蔥花點綴即可拌飯食用"),
                                List.of("主食"), "123"));
        }

}
