// package com.example.quick_recipe_system.cuisine;

// import java.util.List;

// import com.example.quick_recipe_system.model.Recipe;

// public class WesternCuisine extends AbstractCuisine {

//         @Override
//         public String getCuisineName() {
//                 return "西式料理";
//         }

//         public WesternCuisine() {
//                 // 1.
//                 this.addRecipe(new Recipe("奶油培根義大利麵", 20,
//                                 List.of("義大利麵", "培根", "洋蔥", "花椰菜", "洋菇"),
//                                 List.of("鹽巴", "橄欖油", "黑胡椒", "無鹽奶油", "鮮奶油", "起司粉", "蛋黃"),
//                                 List.of("起滾水鍋加入鹽、橄欖油、義大利麵煮至約８分熟後濾出",
//                                                 "取洋蔥切絲，培根切小段入鍋煸炒",
//                                                 "將花椰菜入滾水鍋燙熟，洋菇切片後入炒鍋拌炒",
//                                                 "炒鍋加入麵水煮滾",
//                                                 "炒鍋放入適量黑胡椒調味",
//                                                 "炒鍋放入義大利麵、1/2塊無鹽奶油、鮮奶油、起司粉拌炒1大匙拌炒",
//                                                 "將炒鍋關火後放入蛋黃拌勻，即可盛盤"),
//                                 List.of("白醬", "義大利麵", "西式", "濃郁")));
//                 // 2.
//                 this.addRecipe(new Recipe("西班牙海鮮燉飯", 30,
//                                 List.of("白飯(水跟飯比例1:0.8)", "草蝦5尾(去殼)", "中卷1尾", "蛤蜊10顆", "洋蔥碎半顆", "蒜末一大匙", "紅甜椒碎少許",
//                                                 "臘肉1條"),
//                                 List.of("蝦殼", "鹽", "黑胡椒", "薑黃粉少許", "匈牙利甜椒粉少許", "巴西里2朵"),
//                                 List.of("製作高湯: 起鍋加少許橄欖油，加入一點洋蔥碎、蒜末及蝦殼炒香（蝦殼炒熟即可不要炒到黑），蝦殼熟後，加入水熬煮約１分鐘，即可將蝦殼濾出備用",
//                                                 "鍋子不洗，加入少許橄欖油香煎中卷、蝦子，香煎過程加入少許鹽，黑胡椒調味，煎至８－９分熟起鍋備用",
//                                                 "鍋子一樣不洗，加入一點橄欖油，加入洋蔥碎、蒜末炒香，加入紅甜椒碎、臘肉碎拌炒一下，加入高湯",
//                                                 "加入黃薑粉、匈牙利甜椒粉調味",
//                                                 "加入白飯，讓飯去吸收湯汁，過程中可適當加入湯汁",
//                                                 "加入鹽巴、黑胡椒調味，持續煮讓飯粒吸收湯汁(過程中可持續加入湯汁)",
//                                                 "加入中卷(切成圈)、蝦子、蛤蜊，蓋上鍋蓋開大火悶煮，待蛤蜊開後掀蓋，再轉小火慢慢悶",
//                                                 "待米飯完全吸收湯汁，撒上巴西里末，即可盛盤"),
//                                 List.of("鍋巴", "異國料理", "海鮮", "燉飯")));
//                 // 3.
//                 this.addRecipe(new Recipe(
//                                 "地中海總匯海鮮", 25,
//                                 List.of("中卷1尾", "白蝦仁5尾", "花椰菜5朵"), // 主食材
//                                 List.of("地中海香草鹽適量", "蒜末1/2大匙", "九層塔10片", "黑胡椒適量", "鹽巴適量", "橄欖油適量"), // 調味料
//                                 // 作法
//                                 List.of("蒜頭切末、花椰菜切開、中卷切小段、黑橄欖切片備用",
//                                                 "鍋內放水加鹽巴煮滾，放入花椰菜稍微燙熟撈出",
//                                                 "熱鍋下中卷、蝦子乾烙後加入橄欖油、鹽巴、花椰菜",
//                                                 "加入稍多橄欖油、黑橄欖、蒜末、黑胡椒、九層塔、地中海香草鹽",
//                                                 "翻炒後再補上橄欖油後，盛出至盛品盤，即完成！"),
//                                 List.of("異國料理", "海鮮", "下酒菜"))); // 關鍵字
//                 // 4.
//                 this.addRecipe(new Recipe("香煎牛小排", 10,
//                                 List.of("無骨牛小排2塊(建議厚度2.5公分以上)", "蒜片", "奶油"),
//                                 List.of("研磨海鹽", "黑胡椒", "橄欖油", "巴西里末", "迷迭香(選配)", "白蘿蔔泥(3大匙)", "醬油(2大匙)", "味醂(1大匙)",
//                                                 "紅酒(2大匙)"),
//                                 List.of("在牛排兩面撒上海鹽、黑胡椒並稍微按摩，靜置 5 分鐘後再次吸乾表面水分",
//                                                 "將平底鍋加熱至微冒煙狀",
//                                                 "放入牛小排(牛小排油脂多，可不放油或僅放少許橄欖油)",
//                                                 "每面煎約 3-4 分鐘至表面呈現焦糖金黃色",
//                                                 "在快起鍋前，放入蒜片與奶油，將融化的香料奶油淋在肉塊上增加香氣",
//                                                 "取出牛排，放在熱過的盤子上靜置 5 分鐘",
//                                                 "利用原鍋殘留的牛油，倒入紅酒、醬油、味醂燒開，最後加入白蘿蔔泥拌勻即可\n",
//                                                 "提醒--- 牛排必須先回到常溫，否則容易發生「表面焦掉、內部卻冰冷」的情況",
//                                                 "提醒--- 下鍋前務必用廚房紙巾將表面水分吸乾，這樣煎出來的肉才會香酥（產生梅納反應）",
//                                                 "提醒--- 煎好後不可立即切開，需靜置 5 分鐘讓肉汁回滲，切開時才不會血水四溢"),
//                                 List.of("牛排", "約會經典料理", "蒜香")));

//                 // 5.
//                 this.addRecipe(new Recipe("香蒜蛤蜊義大利麵", 15,
//                                 List.of("蛤蜊(約20顆)", "義大利麵(1把)", "蒜片(10片)", "", "九層塔(30片)"),
//                                 List.of("辣椒(1根)", "九層塔(30片)", "橄欖油", "鹽"),
//                                 List.of("水滾後加 3 匙鹽（水：麵：鹽比例約 100:10:1），放入麵條煮約 7-8 分鐘（比包裝建議少 1 分鐘，預留等等在鍋中吸收湯汁的時間）",
//                                                 "冷鍋下橄欖油與蒜片，小火煸至金黃微焦，放入辣椒末",
//                                                 "放入蛤蜊大火拌炒，加入2-3大匙煮麵水，蓋上鍋蓋燜至蛤蜊開啟後，先將蛤蜊撈起備用（避免蛤蜊肉縮小乾癟）",
//                                                 "將煮好的麵條放入原鍋，開大火讓麵條吸入蛤蜊湯汁，最後倒回蛤蜊、撒上九層塔與黑胡椒，快速翻炒至湯汁收乾呈現光澤感即可\n",
//                                                 "提醒--- 建議使用 2% 濃度的鹽水(500ml 水加 10g 鹽)，模擬海水環境能吐得最乾淨",
//                                                 "提醒--- 因為蛤蜊和煮麵水本身都有鹹味，通常起鍋前不需要額外加鹽，以免過鹹"),
//                                 List.of("義大利麵", "海鮮", "簡單快速", "蒜香")));
//         }

// }
